{
  "lang": "en",
  "link": "https://www.tiktok.com/@quan2k._/video/7498946150200888619",
  "transcription": "The number one most anti-inflammatory food in the world is not turmeric, it's not ginger, and it's definitely not blueberries. Just one teaspoon of this food reduces joint inflammation 60% more than turmeric and ginger combined. It has been used for thousands of years in Asia, but we never hear about it in America. The number one most anti-inflammatory food also restore blood flow, strengthen the heart, clear out veins, improve circulation in the legs and feet, boost energy, relieve pain and cramps, lower the risk of heart disease, and even improve sleep quality. Just imagine the transformation in your health if you took it daily. This ancient remedy is called beetroot. Beetroot helps your body make nitric oxide. That's what opens up your blood vessels, boosts blood flow, and fights pain and swelling. I've been recommending it for years to the people who come to me at 40, 50 years old, who are exhausted, in pain, and frustrated. Three weeks later, they always come back in tears, thanking me, because they feel like a new person. Their faces have changed, they're much happier, and they look much better. And the only change they made was take two beetroot capsules every morning. But before you rush out to grab any beetroot product, there's something important you need to know. To make sure you're getting pure beetroot, it must be certified by independent laboratories in the United States. Rosabella's beetroot is the only one that meets that standard, because only a few small companies can offer true, high-quality beetroot. Unfortunately, other brands claim to sell pure beetroot, but mix it with cheap roots just to increase profits. Rosabella's beetroot only contains one ingredient, 100% pure, fresh, authentic beetroot. If you read the reviews, you'll see that it's a very, very good product and why everyone buys only from this brand. And right now, you can buy one Rosabella beetroot bottle for under $10, thanks to an exclusive discount only available on TikTok Shop. Just so you know, beetroot is usually over $25 for just a single bottle on other websites. The only problem with Rosabella is that they're always sold out. But if there's an orange button somewhere down here, they might have a few bottles left in stock. But hurry, because when they sell out, my patients have waited for months before they found them again.",
  "content": [
    {
      "text": "The number one most anti inflammatory food in the world",
      "duration": 2800,
      "offset": 100
    },
    {
      "text": "is not turmeric, it's not ginger and it's definitely not blueberries.",
      "duration": 3580,
      "offset": 2901
    },
    {
      "text": "Just one teaspoon of this food reduces joint inflammation",
      "duration": 3360,
      "offset": 7180
    },
    {
      "text": "60% more than turmeric and ginger combined.",
      "duration": 2980,
      "offset": 10541
    },
    {
      "text": "It has been used for thousands of years in Asia,",
      "duration": 2240,
      "offset": 13620
    },
    {
      "text": "but we never hear about it in America.",
      "duration": 2220,
      "offset": 15861
    },
    {
      "text": "The No. 1 most anti inflammatory food also restore blood flow,",
      "duration": 4320,
      "offset": 18440
    },
    {
      "text": "strengthen the heart, clear out veins,",
      "duration": 2320,
      "offset": 22980
    },
    {
      "text": "improve circulation in the legs and feet,",
      "duration": 2340,
      "offset": 25301
    },
    {
      "text": "boost energy, relieve pain and cramps,",
      "duration": 3100,
      "offset": 27780
    },
    {
      "text": "lower the risk of heart disease and even improve sleep quality.",
      "duration": 3740,
      "offset": 31060
    },
    {
      "text": "Just imagine the transformation in your health if you took it daily.",
      "duration": 4580,
      "offset": 35100
    },
    {
      "text": "This ancient remedy is called beetroot.",
      "duration": 2380,
      "offset": 40220
    },
    {
      "text": "Beetroot helps your body make nitric oxide.",
      "duration": 2860,
      "offset": 43180
    },
    {
      "text": "That's what opens up your blood vessels,",
      "duration": 1920,
      "offset": 46220
    },
    {
      "text": "boosts blood flow and fights pain and swelling.",
      "duration": 2980,
      "offset": 48141
    },
    {
      "text": "I've been recommending it for years to the people who come to me at 40,",
      "duration": 3400,
      "offset": 51540
    },
    {
      "text": "50 years old who are exhausted,",
      "duration": 1880,
      "offset": 54941
    },
    {
      "text": "in pain and frustrated. Three weeks later,",
      "duration": 2879,
      "offset": 56822
    },
    {
      "text": "they always come back in tears,",
      "duration": 1519,
      "offset": 59702
    },
    {
      "text": "thanking me because they feel like a new person.",
      "duration": 3179,
      "offset": 61222
    },
    {
      "text": "Their faces have changed,",
      "duration": 1320,
      "offset": 64660
    },
    {
      "text": "they're much happier and they look much better.",
      "duration": 2340,
      "offset": 65981
    },
    {
      "text": "And the only change they made was",
      "duration": 1480,
      "offset": 68420
    },
    {
      "text": "take two beetroot capsules every morning.",
      "duration": 2220,
      "offset": 69901
    },
    {
      "text": "But before you rush out to grab any beetroot product,",
      "duration": 2920,
      "offset": 72380
    },
    {
      "text": "there's something important you need to know.",
      "duration": 2700,
      "offset": 75301
    },
    {
      "text": "To make sure you're getting pure beetroot,",
      "duration": 1960,
      "offset": 78340
    },
    {
      "text": "it must be certified by independent laboratories.",
      "duration": 2640,
      "offset": 80301
    },
    {
      "text": "In the United States.",
      "duration": 1419,
      "offset": 82942
    },
    {
      "text": "Rosabella's beetroot is the only one that meets that standard",
      "duration": 3560,
      "offset": 84620
    },
    {
      "text": "because only A few small companies can offer true",
      "duration": 2960,
      "offset": 88181
    },
    {
      "text": "high quality beetroot. Unfortunately,",
      "duration": 3119,
      "offset": 91142
    },
    {
      "text": "other brands claim to sell pure beetroot",
      "duration": 2719,
      "offset": 94262
    },
    {
      "text": "but mix it with cheap roots just to increase profits.",
      "duration": 3339,
      "offset": 96982
    },
    {
      "text": "Rosabella's Beetroot only contains one ingredient 100% pure,",
      "duration": 4600,
      "offset": 100500
    },
    {
      "text": "fresh, authentic beetroot.",
      "duration": 2020,
      "offset": 105101
    },
    {
      "text": "If you read the reviews, you'll see that it's a very,",
      "duration": 2420,
      "offset": 107520
    },
    {
      "text": "very good product and why everyone buys only from this brand.",
      "duration": 3420,
      "offset": 109941
    },
    {
      "text": "And right now",
      "duration": 760,
      "offset": 113500
    },
    {
      "text": "you can buy one Rosabella beet root bottle for under $10",
      "duration": 3900,
      "offset": 114261
    },
    {
      "text": "thanks to an exclusive discount",
      "duration": 1760,
      "offset": 118340
    },
    {
      "text": "only available on TikTok Shop.",
      "duration": 2060,
      "offset": 120101
    },
    {
      "text": "Just so you know, beetroot is usually over $25 for just a single bottle",
      "duration": 4200,
      "offset": 122740
    },
    {
      "text": "on other websites.",
      "duration": 1180,
      "offset": 126941
    },
    {
      "text": "The only problem with Rosabella is that they're always sold out.",
      "duration": 3800,
      "offset": 128380
    },
    {
      "text": "But if there's an orange button somewhere down here,",
      "duration": 2400,
      "offset": 132181
    },
    {
      "text": "they might have a few bottles left in stock.",
      "duration": 1879,
      "offset": 134582
    },
    {
      "text": "But hurry, because when they sell out,",
      "duration": 2219,
      "offset": 136462
    },
    {
      "text": "my patients have waited for months before they found them again.",
      "duration": 3420,
      "offset": 138820
    }
  ]
}
