[
  [
    {
      "profile": "@quan2k._",
      "link": "https://www.tiktok.com/@quan2k._",
      "followers": 41400,
      "type": "ai_generated_videos",
      "scripts": [
        {
          "title": "",
          "link": "https://www.tiktok.com/@quan2k._/video/7498946150200888619",
          "transcription": "The number one most anti-inflammatory food in the world is not turmeric, it's not ginger, and it's definitely not blueberries. Just one teaspoon of this food reduces joint inflammation 60% more than turmeric and ginger combined. It has been used for thousands of years in Asia, but we never hear about it in America. The number one most anti-inflammatory food also restore blood flow, strengthen the heart, clear out veins, improve circulation in the legs and feet, boost energy, relieve pain and cramps, lower the risk of heart disease, and even improve sleep quality. Just imagine the transformation in your health if you took it daily. This ancient remedy is called beetroot. Beetroot helps your body make nitric oxide. That's what opens up your blood vessels, boosts blood flow, and fights pain and swelling. I've been recommending it for years to the people who come to me at 40, 50 years old, who are exhausted, in pain, and frustrated. Three weeks later, they always come back in tears, thanking me, because they feel like a new person. Their faces have changed, they're much happier, and they look much better. And the only change they made was take two beetroot capsules every morning. But before you rush out to grab any beetroot product, there's something important you need to know. To make sure you're getting pure beetroot, it must be certified by independent laboratories in the United States. Rosabella's beetroot is the only one that meets that standard, because only a few small companies can offer true, high-quality beetroot. Unfortunately, other brands claim to sell pure beetroot, but mix it with cheap roots just to increase profits. Rosabella's beetroot only contains one ingredient, 100% pure, fresh, authentic beetroot. If you read the reviews, you'll see that it's a very, very good product and why everyone buys only from this brand. And right now, you can buy one Rosabella beetroot bottle for under $10, thanks to an exclusive discount only available on TikTok Shop. Just so you know, beetroot is usually over $25 for just a single bottle on other websites. The only problem with Rosabella is that they're always sold out. But if there's an orange button somewhere down here, they might have a few bottles left in stock. But hurry, because when they sell out, my patients have waited for months before they found them again.",
          "duration": 142,
          "views": 4100000
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@quan2k._/video/7507255261405498655",
          "transcription": "Did you know that if you're constantly anxious, can't sleep at night, always want sweets and feel tired all the time, you might have too much of the stress hormone called cortisol? But people don't believe me when I tell them this. The number one food to lower your cortisol is not turmeric, it's not ginger. and it's definitely not blueberries. You're also probably waking up at 3 a.m. every night to pee. You randomly get an annoying ringing in your ears, or maybe your hair starts thinning out of nowhere, just like mine was. But most people over the age of 40 tragically ignore these symptoms, until one day they realize it's too late. As you age, your body stops producing nitric oxide, resulting in high cortisol, thicker blood, tighter veins, a silent call for help from your heart. Most people don't even realize it's their poor circulation causing the stress. Maybe you've told your doctors about these symptoms, but they will never tell you that this is a warning sign of something deeper going on in your body, because keeping you sick makes them billions of dollars. But there's a natural healer I've been recommending for years to the people who come to me at 40, 50 years old who are exhausted, in pain, and frustrated. And three weeks later, They always come back in tears thanking me because they feel like a new person. Their faces have changed. They're much happier, and they look much better. This ancient remedy is called beetroot. It helps your body produce nitric oxide, which opens up your blood vessels, improves circulation, and reduces pain and inflammation in your veins. Just one dose of this natural healer every morning could help you restore blood flow, clear out veins, improve circulation in the legs and feet, boost energy, relieve pain and cramps, lower the risk of heart disease, and best of all, it can help you sleep like a baby again. But before you go buy any beetroot, there's one thing you need to know. To make sure you're getting pure organic beetroot, it must be certified by independent laboratories in the United States. The only brand I know that meets that standard is a small company called Rosabella. Sadly, Other brands claim to sell pure beetroot, but mix it with cheap chemicals just to increase profits. Rosabella's beetroot only contains one ingredient, 100% pure, fresh, organic beetroot. If you read the thousands of reviews, You'll see why everyone buys only from this brand. Most people buy it at $29 per bottle, but right now they're doing a small seasonal sale where you can buy a bottle for under $15 for a limited time. The only problem is that they're a small company and they're getting popular, so they can't keep up with the demand. So I want to apologize because if you click the orange button, you might see that they're sold out. And my patients have waited for months before they found them again. But I suggest you click on the orange button so you can see for yourself if they have anything left. So if you want a natural way to improve your nitric oxide levels and improve your pore circulation, I'd run and grab some before they're gone again.",
          "duration": 186,
          "views": 3600000
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@quan2k._/video/7499668163404123438",
          "transcription": "The best food to eat if you want a slim stomach is not turmeric, it's not ginger, and it's definitely not blueberries. Just one teaspoon of this food reduces gut inflammation 60% more than turmeric and ginger combined. It has been used for thousands of years in Asia, but we never hear about it in America. This food will also restore blood flow, strengthen the heart, clear out veins, improve circulation in the legs and feet, boost energy, relieve pain and cramps, lower the risk of heart disease, and even improve sleep quality. Just imagine the transformation in your health if you took it daily. This ancient remedy is called beetroot. Beetroot helps your body make nitric oxide. That's what opens up your blood vessels, boosts blood flow, and fights pain and swelling. I've been recommending it for years to the people who come to me at 40, 50 years old who are exhausted, in pain, and frustrated. Three weeks later, they always come back in tears thanking me because they feel like a new person. Their faces have changed, they're much happier, and they look much better. And the only change they made was take two beetroot capsules every morning. But before you rush out to grab any beetroot product, There's something important you need to know. To make sure you're getting pure beetroot, it must be certified by independent laboratories in the United States. Rosabella's beetroot is the only one that meets that standard because only a few small companies can offer true, high-quality beetroot. Unfortunately, other brands claim to sell pure beetroot but mix it with cheap roots just to increase profits. Rosabella's beetroot only contains one ingredient, 100% pure fresh, authentic beetroot. If you read the reviews, you'll see that it's a very, very good product, and why everyone buys only from this brand. And right now, you can buy one Rosabella beetroot bottle for under $10, thanks to an exclusive discount only available on TikTok Shop. Just so you know, Beetroot is usually over $25 for just a single bottle on other websites. The only problem with Rosabella is that they're always sold out. But if there's an orange button somewhere down here, they might have a few bottles left in stock. But hurry, because when they sell out, my patients have waited for months before they found them again.",
          "duration": 145,
          "views": 2100000
        }
      ]
    },
    {
      "profile": "@healthforlife16",
      "link": "https://www.tiktok.com/@healthforlife16",
      "followers": 37400,
      "type": "ai_generated_videos",
      "scripts": [
        {
          "title": "",
          "link": "https://www.tiktok.com/@healthforlife16/video/7504080960632130847",
          "transcription": "If a woman took magnesium glycinate for two weeks, she'd notice she sleeps much better at night and feels way less stressed and anxious during the day. If she took magnesium citrate every day for two weeks, her digestion would finally feel normal again. She'd notice less bloating, a flatter stomach, and a lighter feeling after meals. If she added magnesium malate to her routine, she'd notice her energy coming back, especially in the mornings. She'd stop feeling like she's dragging through the day and finally have the motivation to get things done. And if she took Magnesium 3 and 8, she'd feel more focused, less forgetful, and mentally sharp, because it's the only form that crosses the blood-grain barrier and supports cognitive health directly. The truth is, your body needs all of these, but no one is taking them in the right amounts every single day, and certainly not all together. So what's the solution? I recommend Magnesium Complex to my patients. It combines all eight essential forms of magnesium including the ones i just mentioned in their purest form it has no fillers and no sugar just two capsules a day and you're giving your body the full spectrum of support it needs stay consistent for 14 days and see the difference in your sleep your skin, your focus, and your energy. I ask the editor to leave the orange button down below. Every bottle is third-party tested and backed by a satisfaction guarantee. Grab yours and then come back to thank me because I promise your days won't be the same again.",
          "duration": 97,
          "views": 2800000
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@healthforlife16/video/7504294197659225375",
          "transcription": "Don't take magnesium before you know this. Magnesium is not magnesium. What I mean by this is magnesium has different forms and each form has different properties and different benefits. You have to choose the right form of magnesium depending on what benefits you want to get out of it. These three are the best forms of magnesium that I always recommend to my patients. The first one is magnesium glycinate. This is the form that helps your body calm down. It supports deep sleep, reduces anxiety, and helps your muscles fully relax. If you're waking up tired, feeling tense, or tossing and turning at night, this is the magnesium your body is begging for. The second is magnesium mullet. This one works at the cellular level to restore energy naturally. It's one of the most effective forms for people with chronic fatigue or low energy. If you feel like you need caffeine just to function, or your mornings feel like you're running on empty, this is the missing piece. And third, magnesium threonate. This one is different. It's the only form that crosses the blood-brain barrier. That means it directly supports memory, focus, and mental clarity. If your mind feels foggy, you keep forgetting things. or you're struggling to stay sharp, this is the form you want. Now, here's the problem. Buying all three separately gets expensive, and worse, you'd need to measure and take them all every single day. That's exactly why I recommend this powerful capsule to my patients. It's called Magnesium Complex, and it combines eight different forms of magnesium, including these three all in one formula in the right amounts. It has no sugar and no gluten, just one capsule a day, and it does all the work for you. You'll start sleeping deeper, waking up with more energy, and thinking clearer throughout the day. And right now, there's a special promo going on here on TikTok Shop. But every time this deal is mentioned, it sells out fast. If you still see the orange button below, that means you're lucky. There are still a few units available. So click it, grab yours, and come back to thank me later. Because I promise, your days won't be the same again.",
          "duration": 136,
          "views": 906800
        }
      ]
    },
    {
      "profile": "@wellnessmommy",
      "link": "https://www.tiktok.com/@wellnessmommy",
      "followers": 13200,
      "type": "ai_generated_videos",
      "scripts": [
        {
          "title": "",
          "link": "https://www.tiktok.com/@wellnessmommy/video/7459151242619620639",
          "transcription": "genetics kids inherit from their mom. Skin tone. Skin tone is a mix of both parents' genes, but moms often pass down dominant traits like freckles or specific pigmentation. Intelligence. Some studies suggest that intelligence is influenced by the X chromosome. Since moms contribute one of their X chromosomes, they play a significant role in passing down cognitive abilities. Smile. A mom's genetics often play a major role in shaping a child's facial structure, including the lips and teeth alignment, which contribute to their smile. Fat storage patterns. Studies suggest that kids may inherit their mom's patterns of fat distribution, which can influence body shape as they grow older. Bone density. A mom's genes significantly influence bone health, particularly in early development, which is why maternal nutrition during pregnancy is so crucial. Postpartum tips. Supporting your baby's health starts with your own. Postpartum hair thinning is a common challenge for new moms. Be proactive and use a hair growth oil that's 100% pure to be fully effective. I used LaBanta's Batana oil and it worked wonders for me. If you're in a pinch, you can get it quickly shipped on Amazon. Follow for more quality baby tips.",
          "duration": 66,
          "views": 4100000
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@wellnessmommy/video/7521650150586993951",
          "transcription": "Why the fuck is no one talking about what this black surgeon said? Just watch. The best remedy in the world to reduce hormonal hair thinning is not ketoconazole, not minoxidil, and it's definitely not collagen. Your scalp probably feels tight when you brush your hair. If you're shedding more than usual in the shower, if your ponytail feels thinner than it used to, you might think it's just a symptom of aging or it's your hormones acting up. And most people over the age of 40 tragically ignore these symptoms until one day they realize it's too late. As you age your body stops producing the very nutrients your hair depends on mainly vitamin b12 zinc biotin and iron then the shedding happens maybe you've told your doctors about these symptoms but they will never tell you that this is a warning sign of something deeper going on in your body because keeping you sick makes them billions of dollars but there's a natural healer I've been recommending for years to the people who come to me at 40 50 years with hair falling off by the loads and six weeks later they always come back in tears thanking me because they look like a new person their hair their nails and even their skin is glowing they look much better. This natural remedy is a blend of vitamin B12, zinc, biotin, and iron that support healthy hair growth. It helps you replenish your body with all the nutrients your hair depends on. Just one dose of this natural healer every morning could help you strengthen hair from the root, speed up growth, reduce thinning, bring back shine, support a healthy scalp, and best of all, make your hair feel like you're in your 20s again. And it's all thanks to this one powerful natural remedy that I started using myself a few years ago. It's made by a small company called Rosabella. If you read the thousands of reviews, you'll see why everyone buys only from this brand. Most people buy it at $29 per bottle, but right now they're doing a small seasonal sale where you can buy a bottle for under $15 for a limited time. The only problem is that they're a small company and they're getting popular, so they can't keep up with the demand. So I want to apologize because if you click the orange button, you might see that they're sold out and my patients have waited for months before they found them again. But I suggest you click on the orange button so you can see for yourself if they have anything left.",
          "duration": 164,
          "views": 411300
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@wellnessmommy/video/7525717830248008990",
          "transcription": "Why the fuck is no one talking about what this surgeon just said? Listen to this motherfucker. The best remedy in the world to reduce hormonal hair thinning is not ketoconazole, not minoxidil, and is definitely not collagen. Your scalp probably feels tight when you brush your hair. If you're shedding more than usual, if your ponytail feels thinner than it used to, you might think it's just a symptom of aging or it's your hormones acting up. And most people over the age of 40 tragically ignore these symptoms until one day they realize it's too late. As you age, your body stops producing the very nutrients your hair depends on, mainly vitamin B12, zinc, biotin and iron. Then the shedding happens. Maybe you've told your doctors about these symptoms but they will never tell you that this is a warning sign of something deeper going on in your body because keeping you sick makes them billions of dollars. But there's a natural healer I've been recommending for years to the people who come to me at 40, 50 years with hair falling off by the lobes, and six weeks later, they always come back in tears thanking me because they look like a new person. Their hair, their nails and even their skin is glowing. They look much better. This natural remedy is a blend of vitamin B12, zinc, biotin and iron that support healthy hair growth. It helps you replenish your body with all the nutrients your hair depends on. Just one dose of this natural healer every morning could help you strengthen hair from the root, speed up growth, reduce thinning, bring back shine, support a healthy scalp, and best of all, make your hair feel like you're in your 20s again. And it's all thanks to this one powerful natural remedy that I started using myself a few years ago. It's made by a small company called Rosabella. If you read the thousands of reviews, you'll see why everyone buys only from this brand. Most people buy it at $29 per bottle but right now they're doing a small seasonal sale where you can buy a bottle for under $12 for a limited time. The only problem is that they're a small company and they're getting popular so they can't keep up with the demand. So I want to apologize because if you click the orange button you might see that they're sold out and my patients have waited for months before they found them again. But I suggest you click on the orange button so you can see for yourself if they have anything left.",
          "duration": 149,
          "views": 337100
        }
      ]
    },
    {
      "profile": "@meirufhe8jc",
      "link": "https://www.tiktok.com/@meirufhe8jc",
      "followers": 17600,
      "type": "ai_generated_videos",
      "scripts": [
        {
          "title": "",
          "link": "https://www.tiktok.com/@meirufhe8jc/video/7520414153652129054",
          "transcription": "If when you take off your bra, your breasts hang so much that they almost hold your waist, you need magnesium citrate. If your intimate area smells like sewage, take magnesium or magnesium aspartate. If your belly looks like that of a seven months pregnant woman, take magnesium carbonate. The best magnesium for sleeping is magnesium glycinate. If you have intestinal problems, you need magnesium aspartate. If you suffer from indigestion, yours is magnesium oxide. If you suffer from muscle cramps, the most appropriate is magnesium tarot. And if you are tired all the time, you need magnesium malate. The problem, buying all these supplements separately is expensive. And the worst thing is you would have to measure and take each one every day. That's why I always recommend VEV magnesium gummies to my patients. This advanced formula brings together all seven forms of magnesium that I mentioned with just the right dose in just one gummy a day, sugar-free, gluten-free, additive-free, and no side effects. In addition, it includes vitamin D3, ashwagandha, L-theanine, and zinc-4 ingredients that make a difference. With them, you will start to sleep like a baby, you will wake up with more energy, and your mind will feel much clearer and more focused. Magnesium is involved in more than 400 biochemical functions in the body, and more than 50% of Americans are deficient. It helps with sleep, stress, muscle relaxation, cramps, and even gut health. There's a special promotion on the TikTok shop right now, but every time it's mentioned, it sells out within hours. If you see the orange button below, it means you still have time. Click it, place your order, and then come back and thank me because I promise you, your life will never be the same.",
          "duration": 99,
          "views": 517800
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@meirufhe8jc/video/7534886242010352926",
          "transcription": "Black women, listen up. To get the body of your dreams, you only need two essential ingredients which the industry works hard to hide. If you've never heard of them, pay attention because they can help you smooth out your middle, bring back your natural curves, and feel confident in anything you wear. First, there's vitamin D3, the sunshine nutrient your body needs to melt that stubborn fluff, reduce puffiness, and wake up your metabolism. When your vitamin D3 levels are low, your cortisol can quietly change how your body looks, so even if you're eating very little, that extra fluff around your midsection just doesn't want to leave. Second, there's vitamin K2, the partner that makes sure calcium goes to your bones instead of building up where it shouldn't. That means stronger bones, healthier joints, and a body that moves and feels younger. The problem? Most supplements give you too little D3, or skip K2 completely so you never really see or feel the difference. That's why I recommend VVD3K2. It gives you 10,000 IU of D3 and 200 mcg of K2 in the perfect balance, pure, potent, and designed to actually work. Just one a day can help you feel lighter, more energized, with smoother skin, stronger hair, and curves you'll love seeing in the mirror. If you still see the orange button below, it means it's still in stock. But every time I share this on TikTok, it sells out fast, so grab it while you can.",
          "duration": 71,
          "views": 621500
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@meirufhe8jc/video/7548011463823133983",
          "transcription": "If you take off your bra and your boobs sag so low they practically reach your waist. You need magnesium citrate if your intimate area smells unpleasant like sewage. You need magnesium orotate if your belly is as big as a pregnant woman's. You need magnesium carbonate if you can't sleep. You need magnesium glycinate if your intestines twist or cramp. You need magnesium aspartate if your digestion is slow, like thick porridge. You need magnesium oxide if your muscles cramp, you need magnesium taurate. And if you feel deep, unexplained fatigue, you need magnesium malate. But listen, don't just take magnesium randomly. Most supplements in stores are full of fillers and empty promises. As my 82 year old mom always says, if it's not pure, it won't heal you. I only trust one brand, vemagnesium. It contains the eight forms of magnesium I just mentioned, plus D3L, theanine, ashwagandha, and zinc. All beneficial, sugar free and gluten free. Take one capsule a day and you'll feel yourself getting back to normal. You'll sleep like you did as a kid. Wake up with strong bones and a clear mind. This mineral from the earth supports over 400 biochemical functions in your body. Yet half of Americans don't get enough magnesium. If you still see the orange button below, you're lucky a few units remain. Click it, get yours, and then come back to thank me because I promise your days will never be the same.",
          "duration": 77,
          "views": 985700
        }
      ]
    },
    {
      "profile": "@hairgrowthsecrets5",
      "link": "https://www.tiktok.com/@hairgrowthsecrets5",
      "followers": 16800,
      "type": "ai_generated_videos",
      "scripts": [
        {
          "title": "",
          "link": "https://www.tiktok.com/@hairgrowthsecrets5/video/7502267991329885482",
          "transcription": "Stop using socks, stop using toilet paper, stop using plastic spoons, stop using Teflon pans, stop using paper towels, stop wearing underwear, stop using hand sanitizer, and definitely don't buy clothes from Temu or Shein because they contain formaldehyde and can cause hair loss. Now if you're experiencing hair loss, I recommend using Batana oil. It naturally regenerates hair and helps stop shedding. The brand I like to use is kiyoma and the link will be attached in this profile.",
          "duration": 31,
          "views": 355600
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@hairgrowthsecrets5/video/7504129081458576686",
          "transcription": "So I keep telling people to stay away from Vaseline. Vaseline is poisonous because if you look at the back of every bottle, it has this ingredient called petrolatum. And what is petrol? It's gasoline. So they are literally giving you the byproducts of gasoline and telling you it's good for your skin. And there are more natural alternatives. One of the best is from this brand, kiyoma, and it's called Batana Oil. Man, this stuff is incredible for your skin and it works wonders for balding. It helps with rashes, dryness and even wrinkles. Give it to a 60 year old woman and it has them looking years younger. It's that powerful. Not only that, but batana oil can reverse alopecia and severe hair loss. It's been used for generations by the indigenous mosquito people, known as the people of beautiful hair. Every person needs this in their routine. Batana oil is the real deal.",
          "duration": 49,
          "views": 420600
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@hairgrowthsecrets5/video/7504750901244988703",
          "transcription": "They kicked this doctor off the podcast after she revealed this. Watch it before they delete it. If you drink ginger and lime every day, this is what will happen to your body first, you will remove toxins from your body much faster. Lime and ginger create a powerful synergy that supports the body's detoxification processes, helping to cleanse the digestive system and improve liver function. Drinking a small cup of this beverage every morning will accelerate your metabolism and promote fat burning. Additionally, they can help relieve joint pain, boost the immune system, and combat infections in the body. If you want to enjoy all these benefits and more, here's how you can prepare this drink. We will need a small piece of ginger, cut it and leave the skin on. You should also chop a lime or a lemon into pieces. Either will work. To improve the taste and add more satiety to this drink, we will add a green apple cut into pieces. Place the ingredients in a blender along with a cup or 200 milliliters of water, blend and then strain the mixture. I always like to add a pinch of black pepper or cayenne pepper at the end for some extra benefits. If the flavor is too strong for you, you can do the same process without the lemon skin and add more water. Drink a small cup of this beverage on an empty stomach for seven days and enjoy its benefits. Start today and Thank me later. See you in the next one. And if you're looking to grow thicker, healthier hair while you're healing your body from the inside, try Batana oil from kiyoma. It's one of the best kept natural secrets for hair growth. And now it's finally available on Amazon. Link will be on this profile.",
          "duration": 88,
          "views": 1800000
        }
      ]
    },
    {
      "profile": "@westacupuncturewellness",
      "link": "https://www.tiktok.com/@westacupuncturewellness/",
      "followers": 24300,
      "type": "real_human",
      "scripts": [
        {
          "title": "",
          "link": "https://www.tiktok.com/@westacupuncturewellness/video/7478041672618741034",
          "transcription": "If you're one of those people who gets cold sores either on the mouth or the other ones and you're stuck taking the terrible um acyclovir, the prescribed Western medicine that that's kind of the only option that they give you when you get a herpes diagnosis is that medicine and that medicine is really, really tough on your both your liver and your kidneys. Um and what I recommend to, oh by the way, my name is Jen West, I'm a acupuncturist and herbalist, and um what I recommend to my patients when they tell me they get cold sores is um Lysine and Monolaurin. And one of the things I like to do um on TikTok is bring good clean brands to you because there are so many products on TikTok as you know and they aren't all super good high quality and I'm really picky about what I recommend to my patients. I love this natural cure Lysine and Monolaurin. Both of these are antivirals and they go right for the herpetic viruses. Um so it's very nice to have a product that has both, because usually I'm recommending um both of these, um because they really knock that virus out. Um it is recommended to take a couple a day. Um but you don't have all the side effects that you get with the other med. So um yeah, I really, really like this super clean company, clean product. Um it's a one to one ratio and um you really got to be careful with herpetic viruses because they respond to stress, they respond to hormones. So a lot of times people will get them right before their period. Um and then sometimes too much sun, too much sugar, alcohol. It's a very sort of sensitive virus, if you will. So taking something like this on a daily basis, which is safe and doesn't have side effects, is a great way to go. I really love this product. I'm going to put it in this little cart down below and if you have any questions about the product just pop it in the comments and I will answer. Hope you have a great day.",
          "duration": 150,
          "views": 1800000
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@westacupuncturewellness/video/7481304164195142954",
          "transcription": "I'm seeing this question a lot. Uh, take the Lysine and Monolaurin daily or just for outbreaks? I'm Emma Jean West. I'm an acupuncturist and herbalist. I've been talking about this um Natural Cure Labs product, which is lysine and Monolaurin. Super clean product. Uh, third-party tested, FDA approved, all the things. Uh, heavy metal tested, super good, clean product. Um, you know, when you get the herpes diagnosis, usually they tell you to take Zovirax or Valtrex or Acyclovir every day for the rest of your life. Um, as we know, viruses can't be eliminated totally. But you can keep this virus in a dormant stage. It likes to hang out in the caudine and your spinal nerves and in your liver, and it just waits for that opportune moment to pop up. Like I said, stress affects it. The food that you eat that's high in arginine, like nuts and chocolate and um alcohol can trigger it. Stress very much triggers this virus. It attacks the nerves in our body, which is part of our nervous system. So that's why it's so sensitive to stress. Um, you really have to choose for yourself. This is a great alternative to those prescription medications. It's a lot more affordable for one thing. There's no side effects. If you're taking one or two a day, that's a safe dosage. You can take up to four a day if you're having the tingles and the prodrome symptoms. So, you know, and if you just want to get crazy and eat a lot of peanut butter, then you take a little more lysine to counteract the arginine. So, it's something that you can kind of play with um, you know, depending on your lifestyle and your diet and your stress levels and all of that. Um, but like I said, this is a super clean product, third-party tested, heavy metal tested, FDA approved. Uh, super good clean company, clean product. Um, I love it. So, I hope this answers your question. You can take it daily or you can take it when you get the prodrome symptoms. If I think if you don't want to take something every single day, then just take one, two, or three four days a week. Something like that. That would probably be enough to kind of keep things in a dormant phase. I hope that helps. Keep asking questions. I'm happy to answer. I will link it below in the orange cart also. Be sure to use my code N A T U J E N 15 for 15% off. I'll write the code down here for you too. Have a good one.",
          "duration": 195,
          "views": 1200000
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@westacupuncturewellness/video/7478438109781364014",
          "transcription": "So, the statistic around herpetic viruses are as follows. 50 to 80% of adults get the cold sores on your mouth and then one in six adults have the other cold sores down south. Which means there are a lot of people that have cold sores. And um, have one or the other or both. And what Western medicine has for you is acyclovir or Valtrex, which is a pretty highly toxic medication that really has shitty side effects and is not good for your liver or your kidneys. Um, and they tell you, you have to just take it forever. Um, they don't talk to you a ton about what it is that kicks off um cold sore breakouts, and that is uh foods with arginine, which is um nuts, specifically peanut butter is terrible if you have herpes. Um, chocolate, alcohol, stress, um, too much sun, um, hormones. So like sometimes, uh women get outbreaks around their periods. Um, this particular virus is just very touchy. And so whether you're eating high arginine foods or you're super stressed out, you, have you ever noticed that one of these things pop up when you're about to go on a trip, or when you're in the midst of some stressful event or or something like that. Um, and so what I always tell my patients is to obviously watch these things, minimize your stress, eat low arginine foods, and then, um, I always tell people to, uh, take lysine and then monolaurin. And this natural cure lab product has um, lycine and monolaurin in it. It's a super clean company, super clean formula. There's no additives or um, other ingredients in it. It's a one-to-one ratio. And so, you can take this product every day if you're very prone to getting cold sores or you can take it when you feel those prodrome symptoms, you know, when you get a little itch or the tingles, you know, that's what that's what we call prodrome symptoms. You can take some heavy doses of it, meaning like you could take four a day and sometimes that'll just completely eliminate it ever coming up. Um, my suggestion is just to take one a day, uh, just as a preventative. It's fine. Um, it's these are both wonderful antivirals. Um, Monolaurin is the antiviral part of coconuts and um, I just love this product. So I'm gonna link it below. If you have any questions at all, just pop them in the comments. By the way, my name is Jennifer West. I'm an acupuncturist and herbalist, been at it for about 25 years and, um, I love to bring good clean products that I see in the TikTok shops to you, because I am very picky about what I recommend to my patients. And I definitely like this company. They put out some good stuff. So, have a great day.",
          "duration": 234,
          "views": 732000
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@westacupuncturewellness/video/7486173226863742251",
          "transcription": "So if you've gotten the diagnosis of HSV-1 or HSV-2, one would be the cold sores on the mouth and two would be the sores that are down self and you've been told by your doc that you just have to take um, acyclovir or Valtrex or any of those antivirals and maybe they make you feel shitty, you don't like them, you don't want to take pharmaceuticals. I have something for you that you can take and use preventatively and to actually treat it when you feel a sore coming on. Hi, my name is Jennifer West. I'm an acupuncturist and herbalist, and I've been at it for almost 25 years. Um, one of my big priorities is recommending clean herbs and supplements to my patients, and I'm very picky about what I put inside of my own body in the form of supplements and herbs and what I give to my children, my family. So one of the things that I do on Tik Tok is I'm always on the hunt for good clean products that are on the TikTok shop. So there is a product by Natural Cure Labs and this is a lysine monolaurin. These two antivirals. Lysine is an amino acid that is in foods like animal products usually, and then monolaurin is the antiviral component of a coconut. So these two together are really wonderful for going after herpetic viruses. And so when I have my patients come into me and they are prone to outbreaks, in other words, they're very sensitive to um, maybe the hormonal changes can can cause a flare-up, stress can cause an outbreak, um surgeries, injuries, uh, there are certain foods that really cause herpetic viruses to flare up and that would be nuts, peanuts especially, um chocolate, alcohol, caffeine, all of these these foods uh, can trigger an outbreak. So, if you're looking for an alternative to taking the acyclovir or Valtrex, which can be really, really hard on your uh, liver and kidneys, then a product like this is a perfect preventative. Uh, if you are prone to outbreaks, you can take one or two a day, um, or, if you don't get outbreaks very often, just at the very first signs, of the tingles, the itchies, the prodrome symptoms that you get when you know it's coming, you can take up to four of these a day. And a lot of times if you alkilze, take some lemon water, really watch your what you're eating, watch your stress, you can head it off at the pass, so it won't even ever come up. Uh, this product is super clean. Third-party tested, made in the United States, no fillers, no additives, no yucky stuff. Um, I love that these two are together. Um, for so many years, I've recommended both lysine and monolaurin because they do target the herpetic viruses. This product having them together is kind of a game changer. Really wonderful. Um, I'm gonna link it below for you. If you have any questions, pop them in the comments. I'd be happy to answer. I hope you have a great day.",
          "duration": 237,
          "views": 377900
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@westacupuncturewellness/video/7490997241533173038",
          "transcription": "If you're looking for a natural alternative to HSV, that's for Simplex 1, the cold sores on the mouth or HSV, two down in your genital area, I have a good alternative for you. Hi, my name is Jen West. I'm an acupuncturist and herbalist, and I have been recommending this product to my patients for many, many, many years. And, um, I'm really glad to see that it's in TikTok shops. This particular company is newer to me. Um, but using lysine and monolaurin are a wonderful alternative if you don't want to take the typical Valtrex, acyclovir, uh, the traditional anti-viral that your Western Doc may prescribe to you. This product. It's just about as powerful as it gets for either stopping the virus in it in its tracks when you feel those prodrome symptoms or treating it if it's already come up, it will make the duration shorter. Um, L-lysine is, um, amino acid and it goes right for the herpetic viruses. And then monolaurin is a wonderful antiviral component of coconut oil. And so having these two together in one product, it's pretty fantastic. You can use this daily, one to two a day, if you are prone to getting infections, uh, sores. If you don't get them very often, you can also just use up to four a day if you want to treat it in the moment. So you feel the prodrome symptoms, you feel that it's coming",
          "duration": 163,
          "views": 340300
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@westacupuncturewellness/video/7416053811032100138",
          "transcription": "Do you get cold sores on your mouth like at the most awful times? Like when you're about to go on a vacation or when you have an exciting day? Or just something, those pesky things pop up. Or do you have the other the other kind of cold sores. The statistics are between 50 and 80 percent of adults get cold sores and then one in six adults get the other type of cold sores. So those statistics are pretty pretty high, right? So it's like almost everybody has either one or the other or both. If you don't know me, my name is Jen West and I'm an acupuncturist and herbalist and I love sharing with you guys about good clean herbs that you can find in the TikTok shop. So in my practice I see a lot of people who have one or the other both because we go through health history in the first appointment. Most of these people, because really the only thing Western medicine really has for that is this really toxic medication that is really, really hard on the liver and the kidneys. And they advise to take it every day for prevention. But they rarely talk about other alternatives or even like what are the triggers for these cold sores. What triggers cold sores? First of all, this virus is really reactive to stress of any sort. Another thing that could flare it up is a lot of sunshine and burn. More like sunburn. But if you're really getting sunburned, that can trigger them. And then foods that are high in arginine. And the most common ones are chocolate, peanuts and peanut butter, walnuts, hazelnuts, almonds, even dairy has pretty high arginine. So these foods you would probably want to avoid. So when my patients are wanting to get off of that toxic medication that I was talking about, there are a couple supplements that I always recommend. One of them is lysine and another one is called monolaurin and that's the antiviral component in coconut oil. And then lysine is an amino acid and antiviral that really goes after the virus that causes cold sores, both on the mouth and the other ones too. So how cool would it be if there was a product that had both lysine and monolaurin in it. So this natural cures product I found in the TikTok shop, super great company, very clean label, non-GMO, third-party tested, really great product that has both lysine and monolaurin in it. Like wonderful. I'm super excited about this. You can buy it one product and you got double the power and punch to knock out that virus. So if you have any questions about this product or about cold sores, I'd be happy to answer. But I'm going to link this below. If you want to grab some. Have a great day.",
          "duration": 227,
          "views": 266400
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@westacupuncturewellness/video/7503985591365881134",
          "transcription": "I often have patients talk to me about how hard it is for them to have genital H-E-R-P-E-S. How hard it is to talk to new partners about it. How shameful, how embarrassing it is and I get it. I get it and I've been there and I just think that it's really important to talk about it more because I think one of the reasons why it's spread so easily and rapidly is because we don't talk about it enough and um so I'm just wanting to kind of open up that that safe space for people to ask questions or um talk about how they feel about having it. I know it's really tough and I I have seen a ton of people over the years over the last 24 years and I get it. So I'm here for any questions or support that you would like. One of the things that acupuncture does is it really improves your immune system and with HSV one and two it is very important to keep your immune system in top notch as much as possible. So we talk a lot about stress because this virus is very sensitive to stress. Um and we talk a lot about diet and um I recommend my favorite preventative herbs and one of my favorites is L-lysine and Monolaurin. Um this product is newer to me, probably in the last six months, but I've been recommending both L-lysine and Monolaurin individually for many, many years. Um it's pretty awesome though to have it in one capsule. If you are very prone to getting outbreaks, then I recommend taking at least two a day. If you don't get outbreaks very often, then you know you can take up to six a day, eight a day when you're feeling those prodromal symptoms. And what I mean by prodrome is the tingles, the itches when you know it's coming. Sometimes you can feel like you're getting the flu. Sometimes you can get little weird things down your leg, your fingers can feel numb, it's nerve pain. This virus attacks the nervous system. So both your immune system is important and stress, which means your nervous system too. So yeah, I love this product. This bottle's 20 bucks and this has actually 100 capsules in it. So this will last you for a little while. And I think it's wonderful and affordable. These are clean herbs, no additives, no weird shit. I take this myself and I recommend it to my patients. So I'm gonna link it below and if you have any questions, pop them in the comments.",
          "duration": 218,
          "views": 272300
        }
      ]
    },
    {
      "profile": "@gisellegonzalezq",
      "link": "https://www.tiktok.com/@gisellegonzalezq/",
      "followers": 59900,
      "type": "real_human",
      "scripts": [
        {
          "title": "",
          "link": "https://www.tiktok.com/@gisellegonzalezq/video/7372334356481740075",
          "transcription": "I was 33 years old when I learned that I could get rid of my freaking cold sore in a matter of hours. Yes, I even have the scar where I used to get all my cold sores and can actually see it over here. This is the scar. It's kind of embarrassing the way that I learned how I could get rid of it because I had this huge cold sore here and there was this very nice lady who ended up telling me what I needed to take in order to remove that from my lip. It was so huge that I could not even cover it. All I had was a bunch of a white cream that wasn't really working, but honestly I was using it because I was so embarrassed for everyone to see that huge, huge cold sore. Anyway, I was minding my business washing my hands in the bathroom when this lady sees my face and she automatically tells me, \"I know a product that it's going to take it away practically instantly.\" Of course, I was very skeptical because I have suffered from cold sores since I was a kid and I know the pain the hazard that it is for that thing to disappear. It would just take a lot of days, more than a week, in order for it to just to start disappearing. I decided to listen to her because I mean what could I what could I lose? She told me you need to buy lysine. I had no idea what she was talking to me about, but I decided to look for it and get it. Lysine is an amino acid that our body needs in order to function and to heal itself. But here's the thing, our body does not reproduce it. We have to consume it through protein like fish, uh meats. Lysine is considered a potential cold sore remedy because it reduces the production of arginine, which is another amino acid that helps the HSV virus to spread, and that's the main reason why cold sore will get humongous if there is no lysine in your body. I'm a true testament of this and I'm going to tell you exactly what to do if you suffer from any sort of cold sore or even herpes around your body. Not sure about the genital one, but if let's say there's people that gets herpes maybe in their back or somewhere in their body because it's triggered by stress, other factors that I'm really not aware of, but this is what I take. Once you start feeling the fever, meaning that you feel something extremely hot, I grab my lysine and I take two pills. I will do the same the next day. Take two pills. And throughout the next three days, I will take one pill per day and I can swear by this because I have seen it all the time in myself that after I take the first two pills, literally probably like four or five hours later, I start to see how it starts to dry. You can feel a tingling sensation of how it's actually drying and how it's actually like being removed, I guess, or disappearing from your from your from your mouth. This one that I'm taking is also here in TikTok. So, I'm just going to link it over in case that you guys wanna take this. And check it out because this is an immune system supporter and trust me, I have given lysine to my mom and to my sister. If you suffer from cold sores, this is your answer to it.",
          "duration": 170,
          "views": 1400000
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@gisellegonzalezq/video/7396063439598243115",
          "transcription": "Reply to miette's comment how do I manage cold sores I haven't had a cold sore outbreak in 6 years thanks to this and it's thanks to lysine. Lysine has helped me to stop the replication of the virus which is the cause of the cold sores. It has helped me reduce the frequency, the severity and the healing time of the outbreak. And monolaurin has antiviral, antifungal antibacterial properties which has helped me boost the immune system. Now why I take this one is because this is scientifically backed up. It has no junk in this it's vegan, um no non GMOs no preservatives no artificial colors it's gluten free and the only extra ingredient that contains is actually coconut. You can see it there and that's about it. That's why I love this one that's why um I recommend this one.",
          "duration": 40,
          "views": 415900
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@gisellegonzalezq/video/7422684456768720174",
          "transcription": "Cold sore hack! I just woke up and I want to show you how it's actually looking. A couple of hours after taking my lysine, look at the results. It's practically gone. I don't feel the tingling anymore. It's not itching anymore because this is my day one of taking the lysine and it started to disappear right away. Now I started yesterday night. I'm gonna continue taking it for like five more days, two pills per day and just a couple of hours. As I said, I took it yesterday night, and look, it's practically gone. But just to make sure I'm gonna take this for five more days. You can take this on a daily basis and it's just gonna help you out. So this is the best one out there. I'm gonna link it below. There's a huge sale. Take advantage guys. And yeah, you don't need to suffer with this thing anymore.",
          "duration": 42,
          "views": 196800
        }
      ]
    },
    {
      "profile": "@coachshanasingleton",
      "link": "https://www.tiktok.com/@coachshanasingleton/",
      "followers": 328400,
      "type": "real_human",
      "scripts": [
        {
          "title": "",
          "link": "https://www.tiktok.com/@coachshanasingleton/video/7357408769812237610",
          "transcription": "I tested positive for herpes back in 2015. After my diagnosis, I was experiencing a lot of outbreaks even with taking antiviral medication. I decided to come off of the antiviral medication around late 2016, early 2017, and was experiencing back-to-back outbreaks. Since then, I have done what I needed to do to body journal, learn my triggers, learn my prodrome symptoms, adjust my lifestyle to stop my outbreaks completely. One thing that I do do is stay on top of my immune system and stay on top of my vitamins. A part of my daily routine is to supplement from Neutraceutica Lab called immune system support. It's a multivitamin, but it doesn't have arginine in it. You see, when I go to Walmart or Walgreens, CVS, whatever pharmacy there is, all the multivitamins are very high in arginine. Arginine feeds the herpes virus, especially during its viral replication process. It needs arginine. So, taking in more arginine than my body already produced is not going to be helpful for me when it comes to me maintaining not having herpes outbreaks. So this is my go-to multivitamin. It has everything I need from vitamin C, D, E, B6, B12, zinc, and selenium. The good thing is it also has lysine in it. If you don't know about lysine, lysine is an essential amino acid that our bodies do not naturally produce, but when present in abundance within us, the virus has a hard time thriving. It also has um ginseng, and echinacea, elderberry, garlic root, garlic tea um garlic, garlic. Garlic root, green tea leaf extract, olive leaf extract, and a resveratrol leaf extract. I swear by this. I take this every day alongside with vitamin D3 and K2, um a daily iron supplement, as well as my Zyrtec for my allergies. I hope this helps.",
          "duration": 121,
          "views": 631600
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@coachshanasingleton/video/7358884644663627039",
          "transcription": "HERPES TIP: Stop if you have herpes. If you are trying to stop, prevent outbreaks, you have to attack the protein coat and block replication. Now the herpes virus has this protein coat that surrounds it, and it's hard to penetrate and it makes it hard for the immune system to fight against the virus. So you need to take something that is going to penetrate that protein coat. Monolaurin has been scientifically proven to penetrate that protein coat and then block replication. It is a great assist when it comes to prevention or stop trying to stop your outbreaks, okay? Now when your immune system shuts down, you're then more susceptible to having an outbreak. Now only does Monolaurin penetrate the glycoprotein coat and block replication, but it is also an immune system support. It's known as Lauric Acid, found in a mother's breast milk. This is what keeps our infants healthy enough because their immune systems are just not built up enough yet to handle what the world has to offer. Now let's keep going. Lysine. Lysine is an essential amino acid that our bodies do not naturally produce, but when present in abundance within us, the virus has an extremely hard time thriving as long as you are working with the Lysine. So if you're putting an abundance of Arginine in your body, which is an amino acid the virus needs in order to be successful during its viral shedding process, a.k.a. when we're experiencing symptoms and outbreaks, then your Lysine isn't going to work because the Lysine and the Arginine compete. So if you're going to take Lysine as a natural supplement, you have to make sure you're not feeding the virus with some with Arginine as well, okay? So this is the GOAT supplement to have at home. This is Lysine and Monolaurin. Click the orange shopping cart, get yours today, it sells out quickly.",
          "duration": 103,
          "views": 304400
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@coachshanasingleton/video/7358153239189015851",
          "transcription": "I stopped my herpes outbreaks. Did you stop yours? If not, let me put you on real quick. One, strong immune system, healthy gut. 75 to 80 percent of your gut lives in your gut. So, you want to live a lifestyle that's in support of a strong immune system. Let's think about HIV. HIV likes to attack the immune system, and so on site, they have beef. It wants all the smoke with the immune system. Herpes is not like that. Herpes is a punk, very scared of the immune system. As long as your immune system is strong, herpes goes into hiding. Let's keep going. Now, we're the most contagious during viral shedding. This is when we are experiencing symptoms or we are experiencing outbreaks. Those are just indications that we're going through viral shedding, right? Um, for herpes to thrive during that process, it needs this amino acid called arginine. If you feed it arginine, it's going to thrive during viral shedding. It's going to keep your outbreak there longer. It's going to make you have the outbreak when problem symptoms appear. So, it's going to be vital for you to avoid foods that are high in arginine. Now, let's talk about lysine. Lysine is an essential amino acid that our bodies do not naturally produce, but when present in abundance within us, the virus has a very hard time thriving. It likes to compete with the arginine. So, if I am taking a bunch of lysine, but I'm also eating a bunch of arginine, I am not helping the lysine win this fight. So, again, avoid foods high in arginine, and put a surplus of lysine in the body. Let's keep going. Remember when I was telling you about supporting your immune system? There's this um thing called monolaurin. Monolaurin is also known as lauric acid, which can be found in a mother's breast milk. This is what keeps our infants healthy enough because their immune system has not fully developed yet, okay? This is what's going to help you support your immune system. Not only that, there's three things you have to do to stop or prevent outbreaks. You have to attack the payload, attack the protein coat, and block replication. Monolaurin has been scientifically proven to attack the glycoprotein coat that surrounds the herpes virus. This protein coat is hard to penetrate, but when you penetrate this protein coat, you are assisting the immune the immune system when it comes to fighting off this virus. Monolaurin has also been proven to block replication, okay? You can find these supplements anywhere, but my go-to supplement is Natural Cure Labs also known as Palmar. It's a clean supplement. This is why this is my go-to. It's going to be exactly what it says on the bottle, lysine and monolaurin. It's a combination supplement. So, if you don't want to take monolaurin separately and lysine separately, you can just take one tablet, one capsule, what, two times a day? Two to three times a day. There we have it. So, click the orange shopping cart.",
          "duration": 176,
          "views": 216100
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@coachshanasingleton/video/7343975437665602859",
          "transcription": "Stop if you have herpes. If you're trying to stop, prevent outbreaks, you have to attack the payload, attack the protein coat, and block replication. Now, the herpes virus has this protein coat that surrounds it, and it's hard to penetrate and it makes it hard for the immune system to fight against the virus. So you need to take something that is going to penetrate that protein coat. Monolaurin has been scientifically proven to penetrate that protein coat and then block replication. It is a great assist when it comes to prevention or stop trying to stop your outbreaks, okay? Now when your immune system shuts down, you're then more susceptible to having an outbreak. Now, only does monolaurin penetrate the glycoprotein coat and block replication, but it is also an immune system support. It's known as lauric acid, found in a mother's breast milk. This is what keeps our infants healthy enough because their immune systems are just not built up enough yet to handle what the world has to offer. Now let's keep going. Lysine. Lysine is an essential amino acid that our bodies do not naturally produce, but when present in abundance within us, the virus has an extremely hard time thriving as long as you are working with the lysine. So if you're putting an abundance of arginine in your body, which is an amino acid the virus needs in order to be successful during its viral shedding process, aka when we're experiencing symptoms and outbreaks, then your lysine is not going to work because the lysine and the arginine compete. So if you're going to take lysine as a natural supplement, you have to make sure you're not feeding the virus with some with arginine as well, okay? So this is the GOAT supplement to have at home. This is lysine and monolaurin. Click the orange shopping cart, get yours today! It sells out quickly.",
          "duration": 103,
          "views": 124100
        }
      ]
    }
  ]
]
