[
  [
    {
      "profile": "@quan2k._",
      "link": "https://www.tiktok.com/@quan2k._",
      "followers": 41400,
      "scripts": [
        {
          "title": "",
          "link": "https://www.tiktok.com/@quan2k._/video/7498946150200888619",
          "transcription": "The number one most anti-inflammatory food in the world is not turmeric, it's not ginger, and it's definitely not blueberries. Just one teaspoon of this food reduces joint inflammation 60% more than turmeric and ginger combined. It has been used for thousands of years in Asia, but we never hear about it in America. The number one most anti-inflammatory food also restore blood flow, strengthen the heart, clear out veins, improve circulation in the legs and feet, boost energy, relieve pain and cramps, lower the risk of heart disease, and even improve sleep quality. Just imagine the transformation in your health if you took it daily. This ancient remedy is called beetroot. Beetroot helps your body make nitric oxide. That's what opens up your blood vessels, boosts blood flow, and fights pain and swelling. I've been recommending it for years to the people who come to me at 40, 50 years old, who are exhausted, in pain, and frustrated. Three weeks later, they always come back in tears, thanking me, because they feel like a new person. Their faces have changed, they're much happier, and they look much better. And the only change they made was take two beetroot capsules every morning. But before you rush out to grab any beetroot product, there's something important you need to know. To make sure you're getting pure beetroot, it must be certified by independent laboratories in the United States. Rosabella's beetroot is the only one that meets that standard, because only a few small companies can offer true, high-quality beetroot. Unfortunately, other brands claim to sell pure beetroot, but mix it with cheap roots just to increase profits. Rosabella's beetroot only contains one ingredient, 100% pure, fresh, authentic beetroot. If you read the reviews, you'll see that it's a very, very good product and why everyone buys only from this brand. And right now, you can buy one Rosabella beetroot bottle for under $10, thanks to an exclusive discount only available on TikTok Shop. Just so you know, beetroot is usually over $25 for just a single bottle on other websites. The only problem with Rosabella is that they're always sold out. But if there's an orange button somewhere down here, they might have a few bottles left in stock. But hurry, because when they sell out, my patients have waited for months before they found them again."
          "duration": 142,
          "views": 4100000
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@quan2k._/video/7507255261405498655",
          "transcription": "Did you know that if you're constantly anxious, can't sleep at night, always want sweets and feel tired all the time, you might have too much of the stress hormone called cortisol? But people don't believe me when I tell them this. The number one food to lower your cortisol is not turmeric, it's not ginger. and it's definitely not blueberries. You're also probably waking up at 3 a.m. every night to pee. You randomly get an annoying ringing in your ears, or maybe your hair starts thinning out of nowhere, just like mine was. But most people over the age of 40 tragically ignore these symptoms, until one day they realize it's too late. As you age, your body stops producing nitric oxide, resulting in high cortisol, thicker blood, tighter veins, a silent call for help from your heart. Most people don't even realize it's their poor circulation causing the stress. Maybe you've told your doctors about these symptoms, but they will never tell you that this is a warning sign of something deeper going on in your body, because keeping you sick makes them billions of dollars. But there's a natural healer I've been recommending for years to the people who come to me at 40, 50 years old who are exhausted, in pain, and frustrated. And three weeks later, They always come back in tears thanking me because they feel like a new person. Their faces have changed. They're much happier, and they look much better. This ancient remedy is called beetroot. It helps your body produce nitric oxide, which opens up your blood vessels, improves circulation, and reduces pain and inflammation in your veins. Just one dose of this natural healer every morning could help you restore blood flow, clear out veins, improve circulation in the legs and feet, boost energy, relieve pain and cramps, lower the risk of heart disease, and best of all, it can help you sleep like a baby again. But before you go buy any beetroot, there's one thing you need to know. To make sure you're getting pure organic beetroot, it must be certified by independent laboratories in the United States. The only brand I know that meets that standard is a small company called Rosabella. Sadly, Other brands claim to sell pure beetroot, but mix it with cheap chemicals just to increase profits. Rosabella's beetroot only contains one ingredient, 100% pure, fresh, organic beetroot. If you read the thousands of reviews, You'll see why everyone buys only from this brand. Most people buy it at $29 per bottle, but right now they're doing a small seasonal sale where you can buy a bottle for under $15 for a limited time. The only problem is that they're a small company and they're getting popular, so they can't keep up with the demand. So I want to apologize because if you click the orange button, you might see that they're sold out. And my patients have waited for months before they found them again. But I suggest you click on the orange button so you can see for yourself if they have anything left. So if you want a natural way to improve your nitric oxide levels and improve your pore circulation, I'd run and grab some before they're gone again."
          "duration": 186,
          "views": 3600000
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@quan2k._/video/7499668163404123438",
          "transcription": "The best food to eat if you want a slim stomach is not turmeric, it's not ginger, and it's definitely not blueberries. Just one teaspoon of this food reduces gut inflammation 60% more than turmeric and ginger combined. It has been used for thousands of years in Asia, but we never hear about it in America. This food will also restore blood flow, strengthen the heart, clear out veins, improve circulation in the legs and feet, boost energy, relieve pain and cramps, lower the risk of heart disease, and even improve sleep quality. Just imagine the transformation in your health if you took it daily. This ancient remedy is called beetroot. Beetroot helps your body make nitric oxide. That's what opens up your blood vessels, boosts blood flow, and fights pain and swelling. I've been recommending it for years to the people who come to me at 40, 50 years old who are exhausted, in pain, and frustrated. Three weeks later, they always come back in tears thanking me because they feel like a new person. Their faces have changed, they're much happier, and they look much better. And the only change they made was take two beetroot capsules every morning. But before you rush out to grab any beetroot product, There's something important you need to know. To make sure you're getting pure beetroot, it must be certified by independent laboratories in the United States. Rosabella's beetroot is the only one that meets that standard because only a few small companies can offer true, high-quality beetroot. Unfortunately, other brands claim to sell pure beetroot but mix it with cheap roots just to increase profits. Rosabella's beetroot only contains one ingredient, 100% pure fresh, authentic beetroot. If you read the reviews, you'll see that it's a very, very good product, and why everyone buys only from this brand. And right now, you can buy one Rosabella beetroot bottle for under $10, thanks to an exclusive discount only available on TikTok Shop. Just so you know, Beetroot is usually over $25 for just a single bottle on other websites. The only problem with Rosabella is that they're always sold out. But if there's an orange button somewhere down here, they might have a few bottles left in stock. But hurry, because when they sell out, my patients have waited for months before they found them again."
          "duration": 145,
          "views": 2100000
        }
      ]
    },
    {
      "profile": "@healthforlife16",
      "link": "https://www.tiktok.com/@healthforlife16",
      "followers": 37400,
      "scripts": [
        {
          "title": "",
          "link": "https://www.tiktok.com/@healthforlife16/video/7504080960632130847",
          "transcription": "If a woman took magnesium glycinate for two weeks, she'd notice she sleeps much better at night and feels way less stressed and anxious during the day. If she took magnesium citrate every day for two weeks, her digestion would finally feel normal again. She'd notice less bloating, a flatter stomach, and a lighter feeling after meals. If she added magnesium malate to her routine, she'd notice her energy coming back, especially in the mornings. She'd stop feeling like she's dragging through the day and finally have the motivation to get things done. And if she took Magnesium 3 and 8, she'd feel more focused, less forgetful, and mentally sharp, because it's the only form that crosses the blood-grain barrier and supports cognitive health directly. The truth is, your body needs all of these, but no one is taking them in the right amounts every single day, and certainly not all together. So what's the solution? I recommend Magnesium Complex to my patients. It combines all eight essential forms of magnesium including the ones i just mentioned in their purest form it has no fillers and no sugar just two capsules a day and you're giving your body the full spectrum of support it needs stay consistent for 14 days and see the difference in your sleep your skin, your focus, and your energy. I ask the editor to leave the orange button down below. Every bottle is third-party tested and backed by a satisfaction guarantee. Grab yours and then come back to thank me because I promise your days won't be the same again."
          "duration": 97,
          "views": 2800000
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@healthforlife16/video/7504294197659225375",
          "transcription": "Don't take magnesium before you know this. Magnesium is not magnesium. What I mean by this is magnesium has different forms and each form has different properties and different benefits. You have to choose the right form of magnesium depending on what benefits you want to get out of it. These three are the best forms of magnesium that I always recommend to my patients. The first one is magnesium glycinate. This is the form that helps your body calm down. It supports deep sleep, reduces anxiety, and helps your muscles fully relax. If you're waking up tired, feeling tense, or tossing and turning at night, this is the magnesium your body is begging for. The second is magnesium mullet. This one works at the cellular level to restore energy naturally. It's one of the most effective forms for people with chronic fatigue or low energy. If you feel like you need caffeine just to function, or your mornings feel like you're running on empty, this is the missing piece. And third, magnesium threonate. This one is different. It's the only form that crosses the blood-brain barrier. That means it directly supports memory, focus, and mental clarity. If your mind feels foggy, you keep forgetting things. or you're struggling to stay sharp, this is the form you want. Now, here's the problem. Buying all three separately gets expensive, and worse, you'd need to measure and take them all every single day. That's exactly why I recommend this powerful capsule to my patients. It's called Magnesium Complex, and it combines eight different forms of magnesium, including these three all in one formula in the right amounts. It has no sugar and no gluten, just one capsule a day, and it does all the work for you. You'll start sleeping deeper, waking up with more energy, and thinking clearer throughout the day. And right now, there's a special promo going on here on TikTok Shop. But every time this deal is mentioned, it sells out fast. If you still see the orange button below, that means you're lucky. There are still a few units available. So click it, grab yours, and come back to thank me later. Because I promise, your days won't be the same again."
          "duration": 136,
          "views": 906800
        }
      ]
    },
    {
      "profile": "@wellnessmommy",
      "link": "https://www.tiktok.com/@wellnessmommy",
      "followers": 13200,
      "scripts": [
        {
          "title": "",
          "link": "https://www.tiktok.com/@wellnessmommy/video/7459151242619620639",
          "transcription": "genetics kids inherit from their mom. Skin tone. Skin tone is a mix of both parents' genes, but moms often pass down dominant traits like freckles or specific pigmentation. Intelligence. Some studies suggest that intelligence is influenced by the X chromosome. Since moms contribute one of their X chromosomes, they play a significant role in passing down cognitive abilities. Smile. A mom's genetics often play a major role in shaping a child's facial structure, including the lips and teeth alignment, which contribute to their smile. Fat storage patterns. Studies suggest that kids may inherit their mom's patterns of fat distribution, which can influence body shape as they grow older. Bone density. A mom's genes significantly influence bone health, particularly in early development, which is why maternal nutrition during pregnancy is so crucial. Postpartum tips. Supporting your baby's health starts with your own. Postpartum hair thinning is a common challenge for new moms. Be proactive and use a hair growth oil that's 100% pure to be fully effective. I used LaBanta's Batana oil and it worked wonders for me. If you're in a pinch, you can get it quickly shipped on Amazon. Follow for more quality baby tips."
          "duration": 66,
          "views": 4100000
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@wellnessmommy/video/7521650150586993951",
          "transcription": "Why the fuck is no one talking about what this black surgeon said? Just watch. The best remedy in the world to reduce hormonal hair thinning is not ketoconazole, not minoxidil, and it's definitely not collagen. Your scalp probably feels tight when you brush your hair. If you're shedding more than usual in the shower, if your ponytail feels thinner than it used to, you might think it's just a symptom of aging or it's your hormones acting up. And most people over the age of 40 tragically ignore these symptoms until one day they realize it's too late. As you age your body stops producing the very nutrients your hair depends on mainly vitamin b12 zinc biotin and iron then the shedding happens maybe you've told your doctors about these symptoms but they will never tell you that this is a warning sign of something deeper going on in your body because keeping you sick makes them billions of dollars but there's a natural healer I've been recommending for years to the people who come to me at 40 50 years with hair falling off by the loads and six weeks later they always come back in tears thanking me because they look like a new person their hair their nails and even their skin is glowing they look much better. This natural remedy is a blend of vitamin B12, zinc, biotin, and iron that support healthy hair growth. It helps you replenish your body with all the nutrients your hair depends on. Just one dose of this natural healer every morning could help you strengthen hair from the root, speed up growth, reduce thinning, bring back shine, support a healthy scalp, and best of all, make your hair feel like you're in your 20s again. And it's all thanks to this one powerful natural remedy that I started using myself a few years ago. It's made by a small company called Rosabella. If you read the thousands of reviews, you'll see why everyone buys only from this brand. Most people buy it at $29 per bottle, but right now they're doing a small seasonal sale where you can buy a bottle for under $15 for a limited time. The only problem is that they're a small company and they're getting popular, so they can't keep up with the demand. So I want to apologize because if you click the orange button, you might see that they're sold out and my patients have waited for months before they found them again. But I suggest you click on the orange button so you can see for yourself if they have anything left."
          "duration": 164,
          "views": 411300
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@wellnessmommy/video/7525717830248008990",
          "transcription": "Why the fuck is no one talking about what this surgeon just said? Listen to this motherfucker. The best remedy in the world to reduce hormonal hair thinning is not ketoconazole, not minoxidil, and is definitely not collagen. Your scalp probably feels tight when you brush your hair. If you're shedding more than usual, if your ponytail feels thinner than it used to, you might think it's just a symptom of aging or it's your hormones acting up. And most people over the age of 40 tragically ignore these symptoms until one day they realize it's too late. As you age, your body stops producing the very nutrients your hair depends on, mainly vitamin B12, zinc, biotin and iron. Then the shedding happens. Maybe you've told your doctors about these symptoms but they will never tell you that this is a warning sign of something deeper going on in your body because keeping you sick makes them billions of dollars. But there's a natural healer I've been recommending for years to the people who come to me at 40, 50 years with hair falling off by the lobes, and six weeks later, they always come back in tears thanking me because they look like a new person. Their hair, their nails and even their skin is glowing. They look much better. This natural remedy is a blend of vitamin B12, zinc, biotin and iron that support healthy hair growth. It helps you replenish your body with all the nutrients your hair depends on. Just one dose of this natural healer every morning could help you strengthen hair from the root, speed up growth, reduce thinning, bring back shine, support a healthy scalp, and best of all, make your hair feel like you're in your 20s again. And it's all thanks to this one powerful natural remedy that I started using myself a few years ago. It's made by a small company called Rosabella. If you read the thousands of reviews, you'll see why everyone buys only from this brand. Most people buy it at $29 per bottle but right now they're doing a small seasonal sale where you can buy a bottle for under $12 for a limited time. The only problem is that they're a small company and they're getting popular so they can't keep up with the demand. So I want to apologize because if you click the orange button you might see that they're sold out and my patients have waited for months before they found them again. But I suggest you click on the orange button so you can see for yourself if they have anything left."
          "duration": 149,
          "views": 337100
        }
      ]
    },
    {
      "profile": "@meirufhe8jc",
      "link": "https://www.tiktok.com/@meirufhe8jc",
      "followers": 17600,
      "scripts": [
        {
          "title": "",
          "link": "https://www.tiktok.com/@meirufhe8jc/video/7520414153652129054",
          "transcription": "If when you take off your bra, your breasts hang so much that they almost hold your waist, you need magnesium citrate. If your intimate area smells like sewage, take magnesium or magnesium aspartate. If your belly looks like that of a seven months pregnant woman, take magnesium carbonate. The best magnesium for sleeping is magnesium glycinate. If you have intestinal problems, you need magnesium aspartate. If you suffer from indigestion, yours is magnesium oxide. If you suffer from muscle cramps, the most appropriate is magnesium tarot. And if you are tired all the time, you need magnesium malate. The problem, buying all these supplements separately is expensive. And the worst thing is you would have to measure and take each one every day. That's why I always recommend VEV magnesium gummies to my patients. This advanced formula brings together all seven forms of magnesium that I mentioned with just the right dose in just one gummy a day, sugar-free, gluten-free, additive-free, and no side effects. In addition, it includes vitamin D3, ashwagandha, L-theanine, and zinc-4 ingredients that make a difference. With them, you will start to sleep like a baby, you will wake up with more energy, and your mind will feel much clearer and more focused. Magnesium is involved in more than 400 biochemical functions in the body, and more than 50% of Americans are deficient. It helps with sleep, stress, muscle relaxation, cramps, and even gut health. There's a special promotion on the TikTok shop right now, but every time it's mentioned, it sells out within hours. If you see the orange button below, it means you still have time. Click it, place your order, and then come back and thank me because I promise you, your life will never be the same."
          "duration": 99,
          "views": 517800
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@meirufhe8jc/video/7534886242010352926",
          "transcription": "Black women, listen up. To get the body of your dreams, you only need two essential ingredients which the industry works hard to hide. If you've never heard of them, pay attention because they can help you smooth out your middle, bring back your natural curves, and feel confident in anything you wear. First, there's vitamin D3, the sunshine nutrient your body needs to melt that stubborn fluff, reduce puffiness, and wake up your metabolism. When your vitamin D3 levels are low, your cortisol can quietly change how your body looks, so even if you're eating very little, that extra fluff around your midsection just doesn't want to leave. Second, there's vitamin K2, the partner that makes sure calcium goes to your bones instead of building up where it shouldn't. That means stronger bones, healthier joints, and a body that moves and feels younger. The problem? Most supplements give you too little D3, or skip K2 completely so you never really see or feel the difference. That's why I recommend VVD3K2. It gives you 10,000 IU of D3 and 200 mcg of K2 in the perfect balance, pure, potent, and designed to actually work. Just one a day can help you feel lighter, more energized, with smoother skin, stronger hair, and curves you'll love seeing in the mirror. If you still see the orange button below, it means it's still in stock. But every time I share this on TikTok, it sells out fast, so grab it while you can."
          "duration": 71,
          "views": 621500
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@meirufhe8jc/video/7548011463823133983",
          "transcription": "If you take off your bra and your boobs sag so low they practically reach your waist. You need magnesium citrate if your intimate area smells unpleasant like sewage. You need magnesium orotate if your belly is as big as a pregnant woman's. You need magnesium carbonate if you can't sleep. You need magnesium glycinate if your intestines twist or cramp. You need magnesium aspartate if your digestion is slow, like thick porridge. You need magnesium oxide if your muscles cramp, you need magnesium taurate. And if you feel deep, unexplained fatigue, you need magnesium malate. But listen, don't just take magnesium randomly. Most supplements in stores are full of fillers and empty promises. As my 82 year old mom always says, if it's not pure, it won't heal you. I only trust one brand, vemagnesium. It contains the eight forms of magnesium I just mentioned, plus D3L, theanine, ashwagandha, and zinc. All beneficial, sugar free and gluten free. Take one capsule a day and you'll feel yourself getting back to normal. You'll sleep like you did as a kid. Wake up with strong bones and a clear mind. This mineral from the earth supports over 400 biochemical functions in your body. Yet half of Americans don't get enough magnesium. If you still see the orange button below, you're lucky a few units remain. Click it, get yours, and then come back to thank me because I promise your days will never be the same."
          "duration": 77,
          "views": 985700
        }
      ]
    },
    {
      "profile": "@hairgrowthsecrets5",
      "link": "https://www.tiktok.com/@hairgrowthsecrets5",
      "followers": 16800,
      "scripts": [
        {
          "title": "",
          "link": "https://www.tiktok.com/@hairgrowthsecrets5/video/7502267991329885482",
          "transcription": "Stop using socks, stop using toilet paper, stop using plastic spoons, stop using Teflon pans, stop using paper towels, stop wearing underwear, stop using hand sanitizer, and definitely don't buy clothes from Temu or Shein because they contain formaldehyde and can cause hair loss. Now if you're experiencing hair loss, I recommend using Batana oil. It naturally regenerates hair and helps stop shedding. The brand I like to use is kiyoma and the link will be attached in this profile."
          "duration": 31,
          "views": 355600
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@hairgrowthsecrets5/video/7504129081458576686",
          "transcription": "So I keep telling people to stay away from Vaseline. Vaseline is poisonous because if you look at the back of every bottle, it has this ingredient called petrolatum. And what is petrol? It's gasoline. So they are literally giving you the byproducts of gasoline and telling you it's good for your skin. And there are more natural alternatives. One of the best is from this brand, kiyoma, and it's called Batana Oil. Man, this stuff is incredible for your skin and it works wonders for balding. It helps with rashes, dryness and even wrinkles. Give it to a 60 year old woman and it has them looking years younger. It's that powerful. Not only that, but batana oil can reverse alopecia and severe hair loss. It's been used for generations by the indigenous mosquito people, known as the people of beautiful hair. Every person needs this in their routine. Batana oil is the real deal."
          "duration": 49,
          "views": 420600
        },
        {
          "title": "",
          "link": "https://www.tiktok.com/@hairgrowthsecrets5/video/7504750901244988703",
          "transcription": "They kicked this doctor off the podcast after she revealed this. Watch it before they delete it. If you drink ginger and lime every day, this is what will happen to your body first, you will remove toxins from your body much faster. Lime and ginger create a powerful synergy that supports the body's detoxification processes, helping to cleanse the digestive system and improve liver function. Drinking a small cup of this beverage every morning will accelerate your metabolism and promote fat burning. Additionally, they can help relieve joint pain, boost the immune system, and combat infections in the body. If you want to enjoy all these benefits and more, here's how you can prepare this drink. We will need a small piece of ginger, cut it and leave the skin on. You should also chop a lime or a lemon into pieces. Either will work. To improve the taste and add more satiety to this drink, we will add a green apple cut into pieces. Place the ingredients in a blender along with a cup or 200 milliliters of water, blend and then strain the mixture. I always like to add a pinch of black pepper or cayenne pepper at the end for some extra benefits. If the flavor is too strong for you, you can do the same process without the lemon skin and add more water. Drink a small cup of this beverage on an empty stomach for seven days and enjoy its benefits. Start today and Thank me later. See you in the next one. And if you're looking to grow thicker, healthier hair while you're healing your body from the inside, try Batana oil from kiyoma. It's one of the best kept natural secrets for hair growth. And now it's finally available on Amazon. Link will be on this profile."
          "duration": 88,
          "views": 1800000
        }
      ]
    }
  ]
]
